#算数运算符：+ - * / // %  **
# print("10+4=",10+4)#加
# print("10-4=",10-4)#减
# print("10*4=",10*4)#乘
# print("10/4=",10/4)#除
# print("10//4=",10//4)#整除（结果为整数）-2
# print("10%4=",10&4)#余
# print("10**4=",10**4)#平方根  10的4次方 -10000

#案例，x，y， 算出x+y，x-y
#float(..)--->将其他类型转换为浮点类型
# x = float(input(" 请输入x的值: "))
# y = float(input(" 请输入y的值: "))
#
#
# # x-y= -1.0000000000000002--->精度损失 ，计算机二进制无法准确表达所有小数
# print("x+y=",x+y)
# print("x-y=",x-y)


# n=int(input("请输入一个整数:"))
# print(f"{n}在10-20之间:",n>=10 and n<=20)
# print(f"{n}在10-20之间:", 10 <= n <= 20)


#==等于   ！=不等于